{
  "1": ["Ура! Поздравляю! Твой челлендж начался! 🥳\nПомни о важности лечь спать к 22:00.\n\nЧтобы день был засчитан - пришли не позднее, чем через 1,5 часа второй отчёт текстовым сообщением, чем полезно было твоё утро", "День засчитан!\n<i>Тех, кто готов прилагать усилия, ждут великие чудеса и невиданные сокровища. Исаак Башевис-Зингер</i>"],
  "2": ["Так держать! Второй день 💪  Улыбнись себе в зеркало и проведи это утро продуктивно!\n\nЧтобы день был засчитан - пришли не позднее, чем через 1,5 часа второй отчёт текстовым сообщением, чем полезно было твоё утро\n", "День засчитан!\n\nКлючевая фигура американского периода Просвещения, отец-основатель Соединённых Штатов, Бенджамин Франклин часто повторял такую пословицу: «Рано ложись, рано вставай — будешь здоровым, богатым и мудрым». Он начинал свой день с того, что вставал в 5 утра и спрашивал себя: «Что хорошего я сделаю сегодня?».\n\nЖду тебя завтра ❤️\n"],
  "3": ["Третий день! До приобретения привычки осталось всего 60 дней. Ты сможешь!\n\nЧтобы день был засчитан - пришли не позднее, чем через 1,5 часа второй отчёт текстовым сообщением, чем полезно было твоё утро\n", "День засчитан!\n\nЛови сегодня информацию про известную раннюю пташку.\nИрвин Симон (руководитель Hain Celestial Group) успевает до девяти утра сделать столько дел, сколько многие не успевают и за день. Проснувшись в 5:00, он сначала проверяет почту и работу подразделений компании в Европе и Азии. Затем он молится, выгуливает собаку, делает зарядку. Всё это он успевает сделать до того, как проснутся его дети. Перед тем как прибыть в свой офис на Лонг-Айленде, он ещё успевает провести деловой завтрак где-нибудь в Манхэттене.\n\nЖду тебя завтра ❤️\n"],
  "4": ["Ты молодец! 🔥 Не забывай вовремя ложиться спать.\n\nЧтобы день был засчитан - пришли не позднее, чем через 1,5 часа второй отчёт текстовым сообщением, чем полезно было твоё утро\n", "День засчитан!\nСтарая поговорка «Кто рано встает, тому Бог подает», возможно, имеет гораздо более глубокий смысл, чем мы думаем.\nЕсли вы откладываете подъем до той секунды, когда уже просто обязаны встать, то есть дожидаетесь последней минуты перед тем, как выбраться из постели и начать свой день, подумайте об этом с такой стороны: поступая так, вы на самом деле сопротивляетесь жизни. Каждый раз, нажимая кнопку повтора сигнала будильника, вы входите в состояние сопротивления своему дню, своей жизни, о которой, по вашим же словам, мечтаете.\n\nДо завтра в том же месте, в тот же час\n"],
  "5": ["Пятый день! У тебя всё получится.\nПредставляешь, учёные говорят, что есть люди, которым достаточно 5 дней, чтобы внедрить привычку. Возможно это ты?\n\nЧтобы день был засчитан - пришли не позднее, чем через 1,5 часа второй отчёт текстовым сообщением, чем полезно было твоё утро\n", "День засчитан!\n<i>Утром людям приходят более правильные мысли, чем вечером. Сергей Лукьяненко</i>\n"],
  "6": ["Шестой день! Вот видишь, у тебя всё получается ✨\n\n \n", "День засчитан!\nСледи за своими утренними мыслями.\nМысли как цветы: сорванные утром, они дольше остаются свежими. Андре Жид\n"],
  "7": ["Ура! Первая неделя пройдена. Осталось всего то 8 недель!\nУ тебя получится совершенно точно. Ты находишься в сильном поле единомышленников.\n\n \n", "День засчитан!\n<i>Маленького крошечного успеха можно достичь одному. Но большого, экстраординарного, масштабного успеха можно достичь только в команде единомышленников. Николай Латанский</i>\n"],
  "8": ["Пошла вторая неделя твоих ранних подъёмов! Ты крепкий орешек.\n\n \n", "День засчитан.\n\nДжон Корзайн, бывший глава Goldman Sachs и MF Global, его коллеги рассказывают, что в офисе он появлялся в шесть утра, а до этого ещё успевал сделать утреннюю пробежку (примерно 8 км).\nЖду тебя завтра❤️.\n"],
  "9": ["Доброе утро! День 9й 😍 С утра можно сделать многое, если не заходить в интернет! 😉 Помни об этом.\n\n \n", "День засчитан!\n<i>Почувствуй силу, которая внутри тебя</i>\n"],
  "10": ["10 дней пройдено. Ты уже чувствуешь свою мощь? 😁💪\n\nЧтобы день был засчитан - пришли не позднее, чем через 1,5 часа второй отчёт текстовым сообщением, чем полезно было твоё утро\n", "День засчитан!\nТим Кук (гендиректор Apple) встаёт в 4:30 утра и первым делом разбирает почту. К пяти часам его можно найти в тренажёрном зале. Он работает очень много и гордится тем, что первым приходит в офис, а уходит последним.\nЭто так… тебе для мотивации. Рано встаёшь, не ты один 😉\n"],
  "11": ["День 11. Улыбайся и не сдавайся.\n\n \n", "День засчитан!\n<i>Утром, когда восходит солнце, позвольте ему взойти и в вас тоже. Ошо.</i>\n"],
  "12": ["Доброе утро! День 12 ☀️\nЛучше быть мягким снаружи и твёрдым внутри, чем твёрдым снаружи и мягким внутри. Лао Цзы.\n\n \n", "День засчитан!\n<i>Если хотите по вечерам ложиться спать с чувством удовлетворения, просыпайтесь каждое утро с чувством решимости. Хэл Элрод.</i>\n"],
  "13": ["День 13. Ты сильный! \nРаб тот, кто не умеет владеть собою.\n\n \n", "День засчитан!\n<i>Если хочешь изменить свою жизнь, будь готов первым делом начать что-нибудь делать по-другому! Хэл Элрод.</i>\n"],
  "14": ["Доброе утро! Сегодня 14й день твоих ранних подъёмов. 2 недели позади. Ты огонь!\n\n \n", "День засчитан!\n<i>Хорошо вставать до рассвета, ибо такие привычки способствуют здоровью богатству и мудрости. Аристотель</i>\n"],
  "15": ["Ты можешь хмуриться и испортить идеальный день или улыбнуться и сделать ужасный день идеальным. Что ты выберешь?\nКстати, сегодня 15й день твоих ранних подъёмов.\n\n \n", "День засчитан!\nХовард Шульц, гендиректор Starbucks, начинает свой день с зарядки. Обычно это поездка на велосипеде с женой. И тем не менее в офис он прибывает уже к шести утра.\nЧто-то такое в Starbucks заставляет людей так себя вести. Президент компании Мишель Гасс встаёт каждое утро в 4:30 и совершает пробежку. И так она делает уже на протяжении 15 лет.\nЗаметь, людей, которые встают рано, достаточно много и все они очень успешны.\n"],
  "16": ["Доброе утро! День 16. Загляни в будущее, в 63й день твоих ранних подъёмов. И скажи себе оттуда, что у тебя всё получится.\n \n", "День засчитан!\n<i>Воля - это то, что заставляет тебя побеждать, когда разум говорит, что ты побеждён. Карлос Кастанеда.</i>\n"],
  "17": ["День 17. Ты очень крутой человек. У тебя всё в жизни получится.\n \n", "День засчитан!\n<i>Те люди, которым удается внести в свою жизнь планомерность и упорядоченность, добиваются наибольшего успеха и самореализации, причем не только в профессиональной, но и в личной жизни.</i>\n"],
  "18": ["Доброе утро! 18й день ранних подъёмов. Лучший повелитель тот, кто умеет повелевать собой.\n \n", "День засчитан!\n<i>Если, проснувшись утром, вы каждый день будете делать маленький шаг в нужном направлении, то удивитесь, как быстро расширятся ваши горизонты.</i>\n"],
  "19": ["Чтобы добиться успеха и быть счастливым, начинай каждый день так, будто это самый важный день в твоей жизни. Доброе утро! Сегодня 19й день.\n \n", "День засчитан!\nПрекрасного тебе дня ✨.\n"],
  "20": ["День 20 💪. Когда вам захочется сдаться, стисните зубы и удвойте усилия. Победа любит упорных. \n \n", "День засчитан!\nТы супер-человек 👍\n"],
  "21": ["Поздравляю! Сегодня 21 день! ⅓ пути пройдена 💪.\n \n", "День засчитан!\nЕсть мнение, что привычка приобретается за 21 день. Да, бывает и так. Но это редкость. Чаще в первые 21 день происходит только разрушение старых привычек. И адаптация психики к новому образу жизни.\nУ тебя проделан уже большой путь! Всё получится!\n"],
  "22": ["Утро – взлетная полоса твоей жизни! День 22.\n \n", "День засчитан!\n<i>Порой и мне не хочется вставать по утрам; и тогда я говорю себе: «Сегодня мне предстоит сделать то, что, кроме меня, не сделает никто». И я встаю и иду. Марк Аврелий, Римский император</i>\n"],
  "23": ["Доброе утро! Сегодня 23й день твоих ранних подъёмов.\nОсталось всего 40 до приобретения привычки и устойчивых нейронных связей.\n \n", "День засчитан!\n<i>Чтобы творить чудеса в мире, научись творить чудо внутри себя самого. Робин Шарма.</i>\nА ты именно это сейчас и делаешь.\n"],
  "24": ["День 24. Доброе утро, ранняя пташка!\nУ тебя сегодня будет прекрасный, продуктивный день!\n \n", "День засчитан!\n<i>Все перемены трудны поначалу, запутаны в середине и роскошны в конце. Робин Шарма.</i>\nЛегкого тебе пути к цели.\n"],
  "25": ["День 25. Доброе-доброе утро, сильный человек!\nКто рано встаёт - тот всё успевает.\n \n", "День засчитан!\nЖду тебя завтра ❤️\n"],
  "26": ["Я так тебя ждал! Доброе утро! Сегодня оно будет особенно продуктивным.\nКстати сегодня день 26й.\n \n", "День засчитан!\n<i>“Иногда все становится возможным, надо только очень сильно захотеть”. Томас Элиот</i>\n"],
  "27": ["Доброе утро! Проведи его так, чтобы зарядиться радостью и энергией на весь день!\nСегодня 26й день твоих ранних подъёмов.\n\n \n", "День засчитан!\n<i>Сила воли - это когда мозг тебе говорит “Всё”, а ты говоришь - нет, это ещё не всё”.</i>\n"],
  "28": ["День 28. Утро сегодня легкое, как пух, — такое утро грех проспать.\n\n \n", "День засчитан!\n<i>Просто почувствовать нежность к мирозданию — лучший повод встать с утра пораньше. Мария Берестова</i>\n"],
  "29": ["Доброе утро! Сегодня 29й день твоих ранних подъёмов. Тело тебе благодарно, что ты приобретаешь такую полезную привычку.\n\n \n", "День засчитан!\n<i>Радуйтесь, что вы можете просыпаться каждое утро и проживать новый день. Будьте счастливы, что вы живы, здоровы, имеете друзей, обладаете способностью творить и ощущать радость бытия. Луиза Хей.</i>\n"],
  "30": ["День 30. Представляешь, ты уже месяц  встаёшь рано утром и уделяешь время себе любимому, саморазвитию и спорту. У тебя формируется уникальная привычка, которая поможет тебе в жизни во всём!\nДоброго и продуктивного тебе утра ✨\n\n \n", "День засчитан!\nЖду тебя завтра ❤️\n"],
  "31": ["День 31. Доброе утро! Начни его с улыбки в зеркало ✨\n\n \n", "День засчитан!\n\nТоп 10 известных и успешных людей, которые всегда рано вставали:\nБенджамин Франклин\nДжордж Буш-старший\nБоб Айгер\nРобин Шарма\nДжек Дорси\nТим Ганн\nРичард Брендсон\nДэн Акерсон\nТим Кук\nГовард Шульц.\nИ ты почти среди них 😉✊.\n"],
  "32": ["Утром один час лучше, чем вечером два. Сегодня 32й день твоих ранних подъёмов.\n\n \n", "День засчитан!\n<i>Сила воли как мышца - чем чаще её используешь, тем сильнее она становится.</i>\nЖду тебя завтра ❤️.\n"],
  "33": ["Ура! Осталось всего 30 дней до цели!\nДоброе утро, милый друг. Сегодня 33й день твоих ранних подъёмов.\n\n \n", "День засчитан!\n\nРоберт Айгер (гендиректор Дисней) встаёт в 4:30 и использует это свободное утреннее время для того, чтобы почитать газеты, заняться спортом, послушать музыку, разобрать электронную почту и посмотреть телевизор. Причем всё это он делает практически одновременно. Даже в эти спокойные минуты он уже многозадачен.\n\nЖду тебя завтра ✊.\n"],
  "34": ["День 34. Пусть это утро принесёт тебе важные инсайты ✨.\n\n \n", "День засчитан!\n<i>Все, кто добился в своей жизни более или менее выдающегося успеха, имели привычку делать то, что остальные люди предпочитают не делать вообще. Робин Шарма.</i>\n"],
  "35": ["Доброе утро! День 35. Обязательно почитай сейчас и сделай физические упражнения.\n\n \n", "День засчитан!\n<i>“Если можно улучшить начало каждого дня, значит, можно изменить и всю траекторию жизни”</i>\n"],
  "36": ["Каждое утро перед нами стоит выбор: продолжать спать и видеть прекрасные сны или встать и воплощать эти сны в реальность. Доброе утро! День 36й.\n\n \n", "День засчитан!\n\nМногие проблемы решаемы одним лёгким поднятием задницы 😉.\nПрекрасного тебе дня!\nЖду завтра утром.\n"],
  "37": ["Доброе утро! Каждый день, когда встаёшь с кровати - не забудь разбудить своё хорошее настроение 😉. Улыбнись себе в зеркало! Сегодня 37й день твоих ранних подъёмов.\n\n \n", "День засчитан!\n\nДэвид Каш (David Cush), глава Virgin America описывает своё утро так: подъём в 4:15, отправка почты, звонки бизнес-партнёрам с Восточного побережья. После этого он слушает утреннюю передачу спортивного радио Далласа, читает газету и занимается на велотренажёре в спортивном зале.\n\nДо завтра в том же месте, в тот же час.\n"],
  "38": ["Каждое утро, просыпаясь, мы выбираем себе настроение сами. Так же как и одежду.\nСегодня 38 день челленджа ранних подъёмов. Ты молодец!\n\n \n", "День засчитан!\n\nУтро – время суток совершенно волшебное, хотя и нелюбимое многими. Я те кто его однажды полюбил - открывают для себя удивительный мир, полный энергии и легкого достижения целей.\n"],
  "39": ["День 39. Утро вечера мудренее - старинная поговорка, а сколько в ней смысла! Послушай тишину внутри себя - там есть все ответы.\n\n \n", "День засчитан!\n\nБудущее начинается сегодня. Это дар, который вручают нам каждое утро.\nМилый друг, жду тебя завтра. Мы совсем близко у цели.\n"],
  "40": ["Доброе утро! Уже 40 дней (40! Карл!) ты встаёшь рано утром!\nПоздравляю! Ты совсем близко у цели 🔥.\n\n \n", "День засчитан!\nЛови сегодня ещё историю про известную  раннюю пташку.\n\nДжерри Лейборн (Gerry Laybourne), основатель Oxygen Channel встаёт в шесть утра и выходит из дома через полчаса. Те, кто встаёт так же рано, могут попасть к ней под крылышко.\nВот что она сама рассказывает: «Несколько раз в неделю по утрам я встречаюсь в Центральном парке с молодым человеком, который обращается ко мне за советом. Помогая ему, я могу поддержать новое поколение. Тот, кто встаёт рано утром, серьёзно относится к жизни. Я не могу выделять время в офисе на подобные беседы, а такие утренние прогулки в парке полезны мне, к тому же помогают держать связь с молодым поколением».\n\nДо завтра ❤️.\nПродуктивного тебе дня.\n"],
  "41": ["Доброе утро, милый друг! Мы так рады, что ты с нами формируешь сильное поле единомышленников по ранним подъёмам. Вместе мы сила! 💪\n\n \n", "День засчитан!\nНичего нет трудного для человека, имеющего силу воли.\n"],
  "42": ["Та-даааам! 42й день - это два раза по 21. Твоя привычка уже сформирована. Осталось пройти ещё 21 день челленджа для создания крепкой нейронной связи.\nДоброго и продуктивного тебе утра!\n\n \n", "День засчитан!\nМеняя свои утренние привычки - ты меняешь свою жизнь.\n"],
  "43": ["День 43. Всего-то осталось 20 дней!\nТы кремень! Доброго тебе утра ☀️\n\n \n", "День засчитан!\nПервый час дня определяет ваш успех. Ты молодец!\nЖду завтра в том же месте, в тот же час 😍.\n"],
  "44": ["Мечты исполняются, только когда встаешь и делаешь. Доброе утро, мой единомышленник! Давай делать 😁✊ Сегодня 44й день.\n\n \n", "День засчитан!\nВыиграть в жизни довольно легко! Все, что нужно сделать - это проснуться утром и идти за мечтой. \n"],
  "45": ["Это сообщение - подарок. Оно наполнено пожеланиями прекрасного дня. Доброе утро!\nДень 45.\n\n \n", "День засчитан!\nКак говорил Генри Форд, \"думаете ли вы, что можете, или думаете, что не можете, - в обоих случаях вы правы.\"\nДо завтра.\n"],
  "46": ["Удача и судьба будут на твоей стороне, если ты встал с кровати прямо сейчас. Хорошего дня! Сегодня 46й день челленджа, который изменит твою жизнь!\n\n \n", "День засчитан!\n\nНезыблемая вера в себя + экстраординарные усилия = чудеса\nЖду тебя завтра. Осталось всего 17 дней до приобретения устойчивой привычки.\n"],
  "47": ["День 47. С этим виртуальным сообщением отправляю тебе виртуальное объятие, чтобы пожелать тебе доброго, волшебного и продуктивного утра. \n\n \n", "День засчитан!\n<i>Есть только два способа прожить жизнь. Первый – так, будто чудес вообще не бывает. Второй – будто все в жизни чудо.  Альберт Эйнштейн</i>\n"],
  "48": ["Жизнь начинается каждое утро. А сегодня очень доброе утро! И 48 день твоих ранних подъёмов. Проведи его с пользой ✨\n\n \n", "День засчитан!\nЗнайте, что настоящий, временный этап вашей жизни и есть именно то положение, в котором вы сейчас должны находиться. Вы пришли к этому моменту, чтобы научиться тому, чему должны научиться, чтобы стать тем человеком, которым должны быть для того, чтобы создать жизнь, которой действительно хотите. Хэл Элрод.\n"],
  "49": ["Доброе утро! День 49. Я рад тебя видеть снова! Ты уже совсем близко у цели.\n\n \n", "День засчитан!\n\n<i>Мотивация заставляет нас начать что-то делать. Привычка же вынуждает продолжать это делать. Джим Рон</i>\nТвоя привычка почти сформирована. Осталось всего 2 недели.\nЖду тебя завтра.\n"],
  "50": ["Это сообщение дает тебе право на бесплатное объятие, как только ты встретишь меня. Доброе утро, милая(ый)! ))) Сегодня 50й день твоих ранних подъёмов!\n\n \n", "День засчитан!\n\nЛюбой человек фактически представляет собой нечто среднее из пяти человек с которыми он больше всего проводит времени. А ты сейчас среди единомышленников по ранним подъёмам ✨.\nДо завтра, милый друг.\n"],
  "51": ["Каждый день - это новое начало, не забудь учиться на вчерашних ошибках, чтобы кататься на волнах сегодняшнего успеха. Доброе утро! 51й день твоих ранних подъёмов!\n\n \n", "День засчитан!\nОсталось всего 12 дней. Ты у цели.\n"],
  "52": ["Посмотри в зеркало и там увидишь очень сильного человека, который уже 52й день практикует ранние подъёмы. Доброе утро!\n\n \n", "День засчитан!\n<i>Сражение выигрывает тот, кто твердо решил его выиграть. Лев Николаевич Толстой.</i>\n"],
  "53": ["С добрым! Всего 10 дней до цели! 😍\n\n \n", "День засчитан!\n<i>Раз уж начал — побеждай. Эрнест Хемингуэй</i>😉\n"],
  "54": ["Встречай новый день с улыбкой на лице, любовью в сердце и благодарностью в душе. Доброе утро! Сегодня день 54.\n\n \n", "День засчитан!\n\n<i>Кто думает как победитель, рано или поздно побеждает. Ричард Бах.</i>\n"],
  "55": ["День 55. Если вы не находите время для спорта, то, скорее всего, вам придётся найти время для лекарств. Начни сегодняшний день со спорта! \n\n \n", "День засчитан!\nПобеда — это когда ты стал лучше чем был.\n"],
  "56": ["Осталась всего неделя до достижения цели! Доброе утро, мой герой! День 56.\n\n \n", "День засчитан!\n\nПобеждает в этой жизни только тот, кто победил сам себя. Кто победил свой страх, свою лень, и свою неуверенность. Виктор Суворов.\nЖду тебя завтра ❤️\n"],
  "57": ["Доброе утро! День 57. Ну что? Пошёл обратный отсчёт до достижения цели 😍. Осталось 6 дней 📢.\n\n \n", "День засчитан!\n\nПобеждает только тот, кто уверен в своей победе на все 100%.\n"],
  "58": ["Успех приходит к тому, кто обладает силой воли одержать победу над будильником. Желаю тебе великолепного утра! Сегодня 58 день. \nОсталось 5 дней 📢.\n\n \n", "День засчитан!\n<i>Победа не всегда означает быть первым, победа — это когда ты стал лучше чем был. Бонни Блэр</i>\n"],
  "59": ["Доброе утро! Сохраняй позитив и с тобой произойдет только хорошее. \nОсталось 4 дня 📢.\n\n \n", "День засчитан!\n\nИскушение сдаться будет особенно сильным незадолго до победы. Китайская поговорка.\nТы же сможешь! 💪\nЖду завтра в то же время, в том же месте ).\n"],
  "60": ["День 60. Ты совсем близко к завершению челленджа.\nОсталось 3 дня 📢.\n\n \n", "День засчитан!\nМаленькая победа над собой делает человека на­много сильней.\n"],
  "61": ["Доброе, милый друг! Желаю тебе прекрасного утра и много энергии!\nОсталось 2 дня 📢.\n\n \n", "День засчитан!\nДо завтра ❤️\n"],
  "62": ["Доброе утро, мой герой! Ты так близко к победе! К победе над собой.\nОстался 1 день 📢.\n\n \n", "День засчитан!\n\nЖду тебя завтра на решающий последний день челленджа!💪\n"],
  "63": ["🔥🔥🔥⚔️⚔️⚔️🥳🥳🥳\nПОЗДРАВЛЯЮ!\nТы прошел(а) челлендж!\nТы приобрел(а) привычку ранних подъёмов!\nВеличайшая победа — победа над самим собой.\n", ""]
}



